# parameters
ch: 3
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3, 1, None, 1, True, 'BN']],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2, None, 1, True, 1, 'BN']],  # 1-P2/4
   [-1, 3, C3, [128, True, 1, 0.5, 'BN']],
   [-1, 1, Conv, [256, 3, 2, None, 1, True, 1, 'BN']],  # 3-P3/8
   [-1, 9, C3, [256, True, 1, 0.5, 'BN']],
  ]

# head
head:
  [[[0, 2, 4], 1, nn.Identity, []],
   [-1, 1, HEstimator, [128, [2,4,8], 0.5, 'BN']],
  ]
