# parameters
ch: 6  # 2 images
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus2, [64, 3, 1, None, 1, True, 'HIN']],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2, None, 1, True, 1, 'HIN']],  # 1-P2/4
   [-1, 3, C3, [128, True, 1, 0.5, 'HIN']],
   [-1, 1, Conv, [256, 3, 2, None, 1, True, 1, 'HIN']],  # 3-P3/8
   [-1, 9, C3, [256, True, 1, 0.5, 'HIN']],
   [-1, 1, Conv, [512, 3, 2, None, 1, True, 1, 'HIN']],  # 5-P4/16
   [-1, 9, C3, [512, True, 1, 0.5, 'HIN']],
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [256, 1, 1, None, 1, True, 1, 'HIN']],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False, 1, 0.5, 'HIN']],  # 10 (s=8)

   [-1, 1, Conv, [128, 1, 1, None, 1, True, 1, 'HIN']],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [-1, 3, C3, [128, False, 1, 0.5, 'HIN']],  # 14 (s=4)

   [-1, 1, Conv, [64, 1, 1, None, 1, True, 1, 'HIN']],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 0], 1, Concat, [1]],  # cat backbone P1
   [-1, 3, C3, [64, False, 1, 0.5, 'HIN']],   # 18 (s=2)

   [[18], 1, Reconstructor, ['HIN']],  # Detect(P3, P4, P5)
  ]
